---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExtrusionStartParam
source: html/164e04c5-4c8e-83bd-e2e4-c51131327a67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExtrusionStartParam Property

"Extrusion Start"

## Syntax (C#)
```csharp
public static ForgeTypeId ExtrusionStartParam { get; }
```